benchmark_results_replicated/20260803_085536/analysis/rep11/run/go_c50/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.96ms    2.40ms  28.39ms   84.07%
    Req/Sec     3.21k   223.10     3.84k    67.46%
  Latency Distribution
     50%    3.44ms
     75%    4.69ms
     90%    6.40ms
     99%   14.35ms
  765890 requests in 1.00m, 93.49MB read
Requests/sec:  12762.29
Transfer/sec:      1.56MB
P95: 8154
P99: 14353